- 날씨 데이터의 변수들을 이용해 내일의 날씨에 대한 예측을 하고자 합니다.
- 다음은 데이터 파일에 대한 설명입니다.
- weather_data.csv : 이 파일은 366건의 정보와 11개의 변수를 가집니다. 

```
tempmin: 최저기온        
tempmax: 최고기온        
rainfall: 강수량       
sunshine: 일조량
windgustspeed: 돌풍속도  
windspeed: 바람속도     
humidity: 습도       
pressure: 기압
cloud: 구름          
raintomorrow: 내일 비 여부 
xgrp: 훈련용 데이터와 테스트용 데이터의 구분
```
1. 내일 비가 올 여부를 나타내는 raintomorrow 컬럼은 "Yes"를 1로, "No"를 0으로 변경합니다. 또한 누락 값을 가진 컬럼을 찾아 해당 컬럼의 평균 값으로 누락 값을 대체합니다. 이 때 평균 값은 소수점 셋째 자리에서 반올림 처리해 사용합니다. 누락 값을 가진 행은 전체 몇 개 입니까?
2. 내일 비가 올 지에 대한 상태를 나타내는 raintomorrow 변수와 부호에 상관없이 상관관계가 가장 큰 변수 세 개를 차례대로 기술하십시오
3. xgrp 변수를 이용해 전체 데이터 세트에서 훈련 데이터 세트(xgrp 변수의 값 1)와 테스트 데이터 세트(xgrp 변수의 값 0)를 구분합니다. 종속변수로 rainbowtomorrow를 사용하고, 독립변수로 나머지 변수를 사용해 로지스틱 회귀분석을 이용해 분류분석을 합니다.  다음의 데이터로 비가 올지에 대한 여부(비가 오면 1, 안오면 0)와 확률 값(소수점 세째자리에서 반올림)을 기술하십시오. tempmin=17.2, tempmax=25.8, rainfall=0, sunshine=8.8, windgustspeed=41, windspeed=6, humidity=74, pressure=1011.5, cloud=7
4. 3번 문제에서 생성한 테스트 데이터를 이용해 분류 분석의 평가지표로 사용되는 정확도를 기술하십시오.
